; ModuleID = 'test.c'
source_filename = "test.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sresult = type { i8*, i32, i8*, i8, i8, i8*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@res = global %struct.sresult zeroinitializer, align 8, !dbg !0
@stderr = external global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [3 x i8] c"%c\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c"%lf\00", align 1
@metadata = internal global i32 0, align 4, !dbg !19
@.str.2 = private unnamed_addr constant [20 x i8] c"res at %p, s at %p\0A\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"> \00", align 1
@stdin = external global %struct._IO_FILE*, align 8
@.str.4 = private unnamed_addr constant [23 x i8] c"Error from read(2): %s\00", align 1
@.str.5 = private unnamed_addr constant [19 x i8] c"processing - '%s'\0A\00", align 1
@.str.6 = private unnamed_addr constant [46 x i8] c"%smatch {'%.*s' - %s - %d %s} is%sa stopword\0A\00", align 1
@.str.7 = private unnamed_addr constant [4 x i8] c"no \00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "res", scope: !2, file: !3, line: 16, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !18, nameTableKind: None)
!3 = !DIFile(filename: "test.c", directory: "/home/Test/Documents/nlp-lex/src/playground")
!4 = !{}
!5 = !{!6, !7, !8, !9, !10, !13, !16, !17}
!6 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!7 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !11, line: 46, baseType: !12)
!11 = !DIFile(filename: "/usr/lib/clang/9.0.0/include/stddef.h", directory: "")
!12 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !14, line: 206, baseType: !15)
!14 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!15 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!18 = !{!0, !19}
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "metadata", scope: !2, file: !3, line: 242, type: !8, isLocal: true, isDefinition: true)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sresult", file: !3, line: 8, size: 384, elements: !22)
!22 = !{!23, !26, !27, !28, !29, !31, !32}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !21, file: !3, line: 9, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !21, file: !3, line: 10, baseType: !8, size: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !21, file: !3, line: 11, baseType: !24, size: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "errc", scope: !21, file: !3, line: 12, baseType: !6, size: 8, offset: 192)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !21, file: !3, line: 13, baseType: !30, size: 8, offset: 200)
!30 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !21, file: !3, line: 14, baseType: !24, size: 64, offset: 256)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "allocd", scope: !21, file: !3, line: 15, baseType: !8, size: 32, offset: 320)
!33 = !{i32 2, !"Dwarf Version", i32 4}
!34 = !{i32 2, !"Debug Info Version", i32 3}
!35 = !{i32 1, !"wchar_size", i32 4}
!36 = !{i32 7, !"PIC Level", i32 1}
!37 = !{!"clang version 9.0.0 (tags/RELEASE_900/final)"}
!38 = distinct !DISubprogram(name: "putchard", scope: !3, file: !3, line: 166, type: !39, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!39 = !DISubroutineType(types: !40)
!40 = !{!7, !7}
!41 = !DILocalVariable(name: "d", arg: 1, scope: !38, file: !3, line: 166, type: !7)
!42 = !DILocation(line: 166, column: 24, scope: !38)
!43 = !DILocalVariable(name: "c", scope: !38, file: !3, line: 167, type: !6)
!44 = !DILocation(line: 167, column: 8, scope: !38)
!45 = !DILocation(line: 167, column: 19, scope: !38)
!46 = !DILocation(line: 167, column: 12, scope: !38)
!47 = !DILocalVariable(name: "x", scope: !38, file: !3, line: 168, type: !8)
!48 = !DILocation(line: 168, column: 7, scope: !38)
!49 = !DILocation(line: 168, column: 19, scope: !38)
!50 = !DILocation(line: 168, column: 33, scope: !38)
!51 = !DILocation(line: 168, column: 11, scope: !38)
!52 = !DILocation(line: 169, column: 19, scope: !38)
!53 = !DILocation(line: 169, column: 10, scope: !38)
!54 = !DILocation(line: 169, column: 3, scope: !38)
!55 = distinct !DISubprogram(name: "eputchard", scope: !3, file: !3, line: 172, type: !39, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!56 = !DILocalVariable(name: "d", arg: 1, scope: !55, file: !3, line: 172, type: !7)
!57 = !DILocation(line: 172, column: 25, scope: !55)
!58 = !DILocalVariable(name: "c", scope: !55, file: !3, line: 173, type: !6)
!59 = !DILocation(line: 173, column: 8, scope: !55)
!60 = !DILocation(line: 173, column: 19, scope: !55)
!61 = !DILocation(line: 173, column: 12, scope: !55)
!62 = !DILocalVariable(name: "x", scope: !55, file: !3, line: 174, type: !8)
!63 = !DILocation(line: 174, column: 7, scope: !55)
!64 = !DILocation(line: 174, column: 19, scope: !55)
!65 = !DILocation(line: 174, column: 33, scope: !55)
!66 = !DILocation(line: 174, column: 11, scope: !55)
!67 = !DILocation(line: 175, column: 19, scope: !55)
!68 = !DILocation(line: 175, column: 10, scope: !55)
!69 = !DILocation(line: 175, column: 3, scope: !55)
!70 = distinct !DISubprogram(name: "printd", scope: !3, file: !3, line: 178, type: !39, scopeLine: 178, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!71 = !DILocalVariable(name: "d", arg: 1, scope: !70, file: !3, line: 178, type: !7)
!72 = !DILocation(line: 178, column: 22, scope: !70)
!73 = !DILocation(line: 179, column: 33, scope: !70)
!74 = !DILocation(line: 179, column: 19, scope: !70)
!75 = !DILocation(line: 179, column: 10, scope: !70)
!76 = !DILocation(line: 179, column: 3, scope: !70)
!77 = distinct !DISubprogram(name: "eprintd", scope: !3, file: !3, line: 182, type: !39, scopeLine: 182, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!78 = !DILocalVariable(name: "d", arg: 1, scope: !77, file: !3, line: 182, type: !7)
!79 = !DILocation(line: 182, column: 23, scope: !77)
!80 = !DILocation(line: 183, column: 27, scope: !77)
!81 = !DILocation(line: 183, column: 42, scope: !77)
!82 = !DILocation(line: 183, column: 19, scope: !77)
!83 = !DILocation(line: 183, column: 10, scope: !77)
!84 = !DILocation(line: 183, column: 3, scope: !77)
!85 = distinct !DISubprogram(name: "dprintdf", scope: !3, file: !3, line: 186, type: !86, scopeLine: 186, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!86 = !DISubroutineType(types: !87)
!87 = !{!7, !7, !7, null}
!88 = !DILocalVariable(name: "fd", arg: 1, scope: !85, file: !3, line: 186, type: !7)
!89 = !DILocation(line: 186, column: 24, scope: !85)
!90 = !DILocalVariable(name: "ptr", arg: 2, scope: !85, file: !3, line: 186, type: !7)
!91 = !DILocation(line: 186, column: 35, scope: !85)
!92 = !DILocalVariable(name: "ap", scope: !85, file: !3, line: 187, type: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !94, line: 52, baseType: !95)
!94 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !96, line: 32, baseType: !97)
!96 = !DIFile(filename: "/usr/lib/clang/9.0.0/include/stdarg.h", directory: "")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, line: 187, baseType: !98)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 192, elements: !106)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 187, size: 192, elements: !100)
!100 = !{!101, !103, !104, !105}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !99, file: !3, line: 187, baseType: !102, size: 32)
!102 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !99, file: !3, line: 187, baseType: !102, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !99, file: !3, line: 187, baseType: !16, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !99, file: !3, line: 187, baseType: !16, size: 64, offset: 128)
!106 = !{!107}
!107 = !DISubrange(count: 1)
!108 = !DILocation(line: 187, column: 11, scope: !85)
!109 = !DILocation(line: 188, column: 3, scope: !85)
!110 = !DILocalVariable(name: "ip", scope: !85, file: !3, line: 190, type: !13)
!111 = !DILocation(line: 190, column: 14, scope: !85)
!112 = !DILocation(line: 190, column: 19, scope: !85)
!113 = !DILocalVariable(name: "res", scope: !85, file: !3, line: 191, type: !7)
!114 = !DILocation(line: 191, column: 10, scope: !85)
!115 = !DILocation(line: 191, column: 40, scope: !85)
!116 = !DILocation(line: 191, column: 34, scope: !85)
!117 = !DILocation(line: 191, column: 52, scope: !85)
!118 = !DILocation(line: 191, column: 44, scope: !85)
!119 = !DILocation(line: 191, column: 56, scope: !85)
!120 = !DILocation(line: 191, column: 25, scope: !85)
!121 = !DILocation(line: 191, column: 16, scope: !85)
!122 = !DILocation(line: 192, column: 3, scope: !85)
!123 = !DILocation(line: 193, column: 10, scope: !85)
!124 = !DILocation(line: 193, column: 3, scope: !85)
!125 = distinct !DISubprogram(name: "mallocd", scope: !3, file: !3, line: 196, type: !39, scopeLine: 196, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!126 = !DILocalVariable(name: "s", arg: 1, scope: !125, file: !3, line: 196, type: !7)
!127 = !DILocation(line: 196, column: 23, scope: !125)
!128 = !DILocalVariable(name: "sze", scope: !125, file: !3, line: 197, type: !10)
!129 = !DILocation(line: 197, column: 10, scope: !125)
!130 = !DILocation(line: 197, column: 25, scope: !125)
!131 = !DILocation(line: 197, column: 16, scope: !125)
!132 = !DILocalVariable(name: "mem", scope: !125, file: !3, line: 198, type: !16)
!133 = !DILocation(line: 198, column: 9, scope: !125)
!134 = !DILocation(line: 198, column: 22, scope: !125)
!135 = !DILocation(line: 198, column: 15, scope: !125)
!136 = !DILocalVariable(name: "ip", scope: !125, file: !3, line: 199, type: !13)
!137 = !DILocation(line: 199, column: 14, scope: !125)
!138 = !DILocation(line: 199, column: 32, scope: !125)
!139 = !DILocation(line: 199, column: 19, scope: !125)
!140 = !DILocation(line: 200, column: 19, scope: !125)
!141 = !DILocation(line: 200, column: 10, scope: !125)
!142 = !DILocation(line: 200, column: 3, scope: !125)
!143 = distinct !DISubprogram(name: "memsetd", scope: !3, file: !3, line: 203, type: !144, scopeLine: 203, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!144 = !DISubroutineType(types: !145)
!145 = !{!7, !7, !7, !7}
!146 = !DILocalVariable(name: "p", arg: 1, scope: !143, file: !3, line: 203, type: !7)
!147 = !DILocation(line: 203, column: 23, scope: !143)
!148 = !DILocalVariable(name: "s", arg: 2, scope: !143, file: !3, line: 203, type: !7)
!149 = !DILocation(line: 203, column: 33, scope: !143)
!150 = !DILocalVariable(name: "n", arg: 3, scope: !143, file: !3, line: 203, type: !7)
!151 = !DILocation(line: 203, column: 43, scope: !143)
!152 = !DILocalVariable(name: "ip", scope: !143, file: !3, line: 204, type: !13)
!153 = !DILocation(line: 204, column: 14, scope: !143)
!154 = !DILocation(line: 204, column: 19, scope: !143)
!155 = !DILocation(line: 205, column: 36, scope: !143)
!156 = !DILocation(line: 205, column: 28, scope: !143)
!157 = !DILocation(line: 205, column: 46, scope: !143)
!158 = !DILocation(line: 205, column: 40, scope: !143)
!159 = !DILocation(line: 205, column: 21, scope: !143)
!160 = !DILocation(line: 205, column: 58, scope: !143)
!161 = !DILocation(line: 205, column: 49, scope: !143)
!162 = !DILocation(line: 205, column: 8, scope: !143)
!163 = !DILocation(line: 205, column: 6, scope: !143)
!164 = !DILocation(line: 206, column: 19, scope: !143)
!165 = !DILocation(line: 206, column: 10, scope: !143)
!166 = !DILocation(line: 206, column: 3, scope: !143)
