; ModuleID = 'test.c'
source_filename = "test.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.WorkingBuffer = type { %struct.sresult*, i32, i32, i32, i32 }
%struct.sresult = type { i8*, i32, i8*, i8, i8, i8*, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@front = internal global %struct.WorkingBuffer { %struct.sresult* getelementptr inbounds ([1024 x %struct.sresult], [1024 x %struct.sresult]* @bufferB, i32 0, i32 0), i32 1024, i32 0, i32 0, i32 0 }, align 8, !dbg !0
@dumpout = internal global i32 0, align 4, !dbg !27
@done = internal global i32 0, align 4, !dbg !29
@back = internal global %struct.WorkingBuffer { %struct.sresult* getelementptr inbounds ([1024 x %struct.sresult], [1024 x %struct.sresult]* @bufferA, i32 0, i32 0), i32 1024, i32 0, i32 0, i32 0 }, align 8, !dbg !31
@.str = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@fst = internal global i32 1, align 4, !dbg !41
@.str.1 = private unnamed_addr constant [20 x i8] c"res at %p, s at %p\0A\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"> \00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "front", scope: !2, file: !3, line: 29, type: !33, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.0 (tags/RELEASE_900/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, nameTableKind: None)
!3 = !DIFile(filename: "test.c", directory: "/home/Test/Documents/nlp-lex/src/playground")
!4 = !{}
!5 = !{!6, !25, !0, !27, !29, !31, !41}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "bufferA", scope: !2, file: !3, line: 16, type: !8, isLocal: false, isDefinition: true)
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 393216, elements: !23)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sresult", file: !3, line: 3, size: 384, elements: !10)
!10 = !{!11, !15, !17, !18, !19, !21, !22}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !9, file: !3, line: 4, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !9, file: !3, line: 5, baseType: !16, size: 32, offset: 64)
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !9, file: !3, line: 6, baseType: !12, size: 64, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "errc", scope: !9, file: !3, line: 7, baseType: !14, size: 8, offset: 192)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !9, file: !3, line: 8, baseType: !20, size: 8, offset: 200)
!20 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !9, file: !3, line: 9, baseType: !12, size: 64, offset: 256)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "allocd", scope: !9, file: !3, line: 10, baseType: !16, size: 32, offset: 320)
!23 = !{!24}
!24 = !DISubrange(count: 1024)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "bufferB", scope: !2, file: !3, line: 17, type: !8, isLocal: false, isDefinition: true)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "dumpout", scope: !2, file: !3, line: 51, type: !16, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "done", scope: !2, file: !3, line: 49, type: !16, isLocal: true, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "back", scope: !2, file: !3, line: 27, type: !33, isLocal: true, isDefinition: true)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WorkingBuffer", file: !3, line: 19, size: 192, elements: !34)
!34 = !{!35, !37, !38, !39, !40}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !33, file: !3, line: 20, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !33, file: !3, line: 21, baseType: !16, size: 32, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !33, file: !3, line: 22, baseType: !16, size: 32, offset: 96)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !33, file: !3, line: 23, baseType: !16, size: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !33, file: !3, line: 24, baseType: !16, size: 32, offset: 160)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "fst", scope: !2, file: !3, line: 50, type: !16, isLocal: true, isDefinition: true)
!43 = !{i32 2, !"Dwarf Version", i32 4}
!44 = !{i32 2, !"Debug Info Version", i32 3}
!45 = !{i32 1, !"wchar_size", i32 4}
!46 = !{i32 7, !"PIC Level", i32 2}
!47 = !{i32 7, !"PIE Level", i32 2}
!48 = !{!"clang version 9.0.0 (tags/RELEASE_900/final)"}
!49 = distinct !DISubprogram(name: "__nlex_postag_m", scope: !3, file: !3, line: 53, type: !50, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !36, !12}
!52 = !DILocalVariable(name: "res", arg: 1, scope: !49, file: !3, line: 53, type: !36)
!53 = !DILocation(line: 53, column: 38, scope: !49)
!54 = !DILocalVariable(name: "ptag", arg: 2, scope: !49, file: !3, line: 53, type: !12)
!55 = !DILocation(line: 53, column: 55, scope: !49)
!56 = !DILocalVariable(name: "pos_fst", scope: !49, file: !3, line: 54, type: !16)
!57 = !DILocation(line: 54, column: 7, scope: !49)
!58 = !DILocation(line: 55, column: 13, scope: !59)
!59 = distinct !DILexicalBlock(scope: !49, file: !3, line: 55, column: 7)
!60 = !DILocation(line: 55, column: 7, scope: !59)
!61 = !DILocation(line: 55, column: 7, scope: !49)
!62 = !DILocation(line: 57, column: 6, scope: !63)
!63 = distinct !DILexicalBlock(scope: !59, file: !3, line: 55, column: 20)
!64 = !DILocation(line: 57, column: 18, scope: !63)
!65 = !DILocation(line: 57, column: 36, scope: !63)
!66 = !DILocation(line: 57, column: 12, scope: !63)
!67 = !DILocation(line: 58, column: 15, scope: !68)
!68 = distinct !DILexicalBlock(scope: !63, file: !3, line: 58, column: 9)
!69 = !DILocation(line: 58, column: 30, scope: !68)
!70 = !DILocation(line: 58, column: 21, scope: !68)
!71 = !DILocation(line: 58, column: 9, scope: !63)
!72 = !DILocation(line: 59, column: 15, scope: !73)
!73 = distinct !DILexicalBlock(scope: !68, file: !3, line: 58, column: 35)
!74 = !DILocation(line: 60, column: 7, scope: !73)
!75 = !DILocation(line: 61, column: 15, scope: !73)
!76 = !DILocation(line: 62, column: 5, scope: !73)
!77 = !DILocation(line: 63, column: 9, scope: !78)
!78 = distinct !DILexicalBlock(scope: !63, file: !3, line: 63, column: 9)
!79 = !DILocation(line: 63, column: 9, scope: !63)
!80 = !DILocation(line: 64, column: 7, scope: !78)
!81 = !DILocation(line: 65, column: 3, scope: !63)
!82 = !DILocation(line: 66, column: 13, scope: !59)
!83 = !DILocation(line: 67, column: 7, scope: !84)
!84 = distinct !DILexicalBlock(scope: !49, file: !3, line: 67, column: 7)
!85 = !DILocation(line: 67, column: 7, scope: !49)
!86 = !DILocation(line: 68, column: 5, scope: !84)
!87 = !DILocation(line: 69, column: 12, scope: !88)
!88 = distinct !DILexicalBlock(scope: !49, file: !3, line: 69, column: 7)
!89 = !DILocation(line: 69, column: 7, scope: !88)
!90 = !DILocation(line: 69, column: 7, scope: !49)
!91 = !DILocation(line: 70, column: 5, scope: !92)
!92 = distinct !DILexicalBlock(scope: !88, file: !3, line: 69, column: 19)
!93 = !DILocation(line: 71, column: 5, scope: !92)
!94 = !DILocation(line: 72, column: 5, scope: !92)
!95 = !DILocation(line: 73, column: 15, scope: !96)
!96 = distinct !DILexicalBlock(scope: !92, file: !3, line: 73, column: 9)
!97 = !DILocation(line: 73, column: 29, scope: !96)
!98 = !DILocation(line: 73, column: 21, scope: !96)
!99 = !DILocation(line: 73, column: 9, scope: !92)
!100 = !DILocation(line: 74, column: 8, scope: !96)
!101 = !DILocation(line: 74, column: 20, scope: !96)
!102 = !DILocation(line: 74, column: 38, scope: !96)
!103 = !DILocation(line: 74, column: 14, scope: !96)
!104 = !DILocation(line: 74, column: 7, scope: !96)
!105 = !DILocation(line: 76, column: 19, scope: !106)
!106 = distinct !DILexicalBlock(scope: !96, file: !3, line: 75, column: 10)
